0#SQL
1.
Есть таблица balance с данными по балансам клиентов с 2015 года.
  • client_id - это идентификатор клиента
  • total_balance - текущий баланс
  • update_ts - время обновления инфы
и таблица fio с именем клиента
  • client_id - идентификатор клиента
  • fio - фио
Нужно вывести fio клиента/ов с максимальным балансом за текущий месяц. Возможны ситуации, когда под условие попадет несколько клиентов.

Пример таблиц:
balance
+----------------+------------------------------+----------------------+
|client_id (int) |total_balance (decimal(16,2)) |update_ts (timestamp) |
+----------------+------------------------------+----------------------+
|55555           |0,00                          |18.05.2023 9:54:07    |
+----------------+------------------------------+----------------------+
|9100003         |0,00                          |18.05.2023 10:00:07   |
+----------------+------------------------------+----------------------+
|9100004         |148999,22                     |18.05.2023 10:00:07   |
+----------------+------------------------------+----------------------+
|9100004         |500,50.                       |20.05.2023 10:00:07   |
+----------------+------------------------------+----------------------+

fio
+----------------+------------------------------+
|client_id (int) |fio (varchar(200))            |
+----------------+------------------------------+
|9100003         |Иванов Петр Иванович          |
+----------------+------------------------------+
|9100004         |Соколов Илья Денисович        |
|9100006         |Иванов Петр Иванович       
+----------------+------------------------------+

Вывод:

+-------------------+
|fio (varchar(200)) |
+-------------------+
|fio_9100004        |
+-------------------+


Script:
with balance_t as
(select client_id, total_balance, max(total_balance) over (partition by extract(month from update_ts),extract(year from update_ts)) as max_balance from balance
where extract(month from update_ts) =  extract(month from now()) and extract(year from update_ts) =  extract(year from now()) )
) 
select distinct fio from balance_t b
left join fio f 
on f.client_id = b.client_id 
where max_balance = total_balance


2.
Есть таблица activity, в который хранятся данные по различным видам активности клиентов на сайте.
Нужно посчитать количество пользователей, у которых была любая активность и в текущем, и в прошлом месяце.

Пример таблицы:

+------------+----------------+--------------+---------------+
|date (date) |client_id (int) |client_activity_type_id (int) |
+------------+----------------+-------------+----------------+
|  18.11.2023|         9100146|                             1|
+------------+----------------+------------------------------+
|  18.11.2023|        10003560|                             3|
+------------+----------------+------------------------------+
|  18.12.2023|         9100146|                             5|
+------------+----------------+------------------------------+


Вывод:

+------------------+
|count_client (int)|
+------------------+
|                 1|
+------------------+


Script:

select count(distinct client_id) as count_client from activity a 
where client_id in (select  client_id where date > datetrunc(now() - interval '1 month') and date < datetrunc(now()))
      and client_id in (select client_id where date > datetrunc(now()))
-- group by client_id


4.
Есть таблица transaction, в который хранятся данные по различным транзакциям клиентов.
Нужно посчитать сумму подряд идущих транзакций одного клиента у одного мерчанта.
(вывод должен быть в том же порядке как во входной таблице)

Пример таблицы:


+--------------------+----------------+------------------+---------------+
|date (timestamp)    |client_id (int) |merchant_id (int) |amount (double)|
+--------------------+----------------+------------------+---------------+
|18.05.2023 9:53:07  |1000356         |                2 |       500.0   |
+--------------------+----------------+------------------+---------------+
|18.05.2023 9:54:07  |9100146         |                1 |       100.4   |
+--------------------+----------------+------------------+---------------+
|18.05.2023 10:54:07 |9100146         |                1 |       500.0   |
+--------------------+----------------+------------------+---------------+
|18.05.2023 10:58:07 |1000356         |                2 |       500.0   |
+--------------------+----------------+------------------+---------------+
|18.05.2023 10:59:07 |9100146         |                1 |       100.0   |
+--------------------+----------------+------------------+---------------+

Вывод:

+----------------+------------------+---------------+
|client_id (int) |merchant_id (int) |amount (double)|
+----------------+------------------+---------------+
|1000356         |                2 |       500.0   |
+----------------+------------------+---------------+
|9100146         |                1 |       600.4   |
+----------------+------------------+---------------+
|1000356         |                2 |       500.0   |
+----------------+------------------+---------------+
|9100146         |                1 |       100.0   |
+----------------+------------------+---------------+

Script:




